#                 ██
#                ░██
#  ██████  ██████░██      ██████  █████
# ░░░░██  ██░░░░ ░██████ ░░██░░█ ██░░░██
#    ██  ░░█████ ░██░░░██ ░██ ░ ░██  ░░
#   ██    ░░░░░██░██  ░██ ░██   ░██   ██
#  ██████ ██████ ░██  ░██░███   ░░█████
# ░░░░░░ ░░░░░░  ░░   ░░ ░░░     ░░░░░


source "$ZDOTDIR/init.zsh"      # zshinit
source "$ZDOTDIR/ohmyzsh.zsh"   # ohmyzsh
source "$ZDOTDIR/vimode.zsh"    # zshvimode 必须放在ohmyzsh后面
source "$ZDOTDIR/alias.zsh"     # zshalias
source "$ZDOTDIR/bindkey.zsh"   # zshbindKey
source "$ZDOTDIR/config.zsh"    # zshconf
